tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_read_dvstctr
 Description     : Returns the specified port's DVSTCTR register content.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  port  : USB port number. ($REA not used.)
 Return value    : DVSTCTR0 content
 ******************************************************************************/
uint16_t hw_usb_read_dvstctr (usb_utr_t *ptr, uint16_t port)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        return (uint16_t)(USB_M0.DVSTCTR0.WORD);
#else
        return (uint16_t)(USB_M1.DVSTCTR0.WORD);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        return (uint16_t) (ptr->ipp->DVSTCTR0.WORD);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    return 0;
}
/******************************************************************************
 End of function hw_usb_read_dvstctr
 ******************************************************************************/

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Function Name   : hw_usb_write_dvstctr
 Description     : Write data to the specified port's DVSTCTR register.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  port  : USB port number.
                 : uint16_t  data  : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_dvstctr (usb_utr_t *ptr, uint16_t port, uint16_t data)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->DVSTCTR0.WORD = data;
    }
}
/******************************************************************************
 End of function hw_usb_write_dvstctr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_rmw_dvstctr
 Description     : Read-modify-write the specified port's DVSTCTR.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  port  : Port number
                 : uint16_t  data  : The value to write.
                 : uint16_t  bitptn: Bit pattern to read-modify-write.
 Return value    : none
 ******************************************************************************/
void hw_usb_rmw_dvstctr (usb_utr_t *ptr, uint16_t port, uint16_t data, uint16_t bitptn)
{
    uint16_t buf;

    if (USB_PORT0 == port)
    {
        buf = ptr->ipp->DVSTCTR0.WORD;
        buf &= (~bitptn);
        buf |= (data & bitptn);
        ptr->ipp->DVSTCTR0.WORD = buf;
    }
}
/******************************************************************************
 End of function hw_usb_rmw_dvstctr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_dvstctr
 Description     : Clear the bit pattern specified in argument, of the specified 
                 : port's DVSTCTR register.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  port  : Port number
                 : uint16_t  bitptn: Bit pattern to read-modify-write.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_dvstctr (usb_utr_t *ptr, uint16_t port, uint16_t bitptn)
{
    if (USB_PORT0 == port)
    {
        ptr->ipp->DVSTCTR0.WORD &= (~bitptn);
    }
}
/******************************************************************************
 End of function hw_usb_clear_dvstctr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_vbout
 Description     : Set specified port's VBOUT-bit in the DVSTCTR register.
                 : (To output a "High" to pin VBOUT.) 
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  port  : Port number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_vbout (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
#if USB_CFG_VBUS == USB_CFG_HIGH
        ptr->ipp->DVSTCTR0.WORD |= USB_VBUSEN;

#else  /* USB_CFG_VBUS == USB_CFG_HIGH */
        ptr->ipp->DVSTCTR0.WORD &= (~USB_VBUSEN);

#endif /* USB_CFG_VBUS == USB_CFG_HIGH */
    }
}
/******************************************************************************
 End of function hw_usb_set_vbout
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_vbout
 Description     : Clear specified port's VBOUT-bit in the DVSTCTR register.
                 : (To output a "Low" to pin VBOUT.)
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  port  : Port number
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_vbout (usb_utr_t *ptr, uint16_t port)
{
    if (USB_PORT0 == port)
    {
#if USB_CFG_VBUS == USB_CFG_HIGH
        ptr->ipp->DVSTCTR0.WORD &= (~USB_VBUSEN);

#else  /* USB_CFG_VBUS == USB_CFG_HIGH */
        ptr->ipp->DVSTCTR0.WORD |= USB_VBUSEN;

#endif /* USB_CFG_VBUS == USB_CFG_HIGH */
    }
}
/******************************************************************************
 End of function hw_usb_clear_vbout
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

#if defined(BSP_MCU_RX71M)
/******************************************************************************
 Function Name   : hw_usb_set_utst
 Description     : Not processed as the functionality is provided by R8A66597(ASSP).
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_set_utst(usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
#else
        USB_M1.TESTMODE.WORD = data;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp1->TESTMODE.WORD = data;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_utst
 ******************************************************************************/
#endif  /* (BSP_MCU_RX71M) */

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
/******************************************************************************
 Function Name   : hw_usb_read_fifo32
 Description     : Data is read from the specified pipemode's FIFO register, 32-bits 
                 : wide, corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 Return value    : CFIFO/D0FIFO/D1FIFO content (32-bit)
 ******************************************************************************/
uint32_t hw_usb_read_fifo32(usb_utr_t *ptr, uint16_t pipemode)
{
    uint32_t data;

