tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_get_fifosel_adr
 Description     : Returns the *address* of the FIFOSEL register corresponding to 
                 : specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
static void *hw_usb_get_fifosel_adr (usb_utr_t *ptr, uint16_t pipemode)
{
    void *p_reg;

    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
        switch (pipemode)
        {
            case USB_CUSE:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
            p_reg = (void *)&(USB_M1.CFIFOSEL);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            p_reg = (void *)&(USB_M0.CFIFOSEL);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            break;

            case    USB_D0USE:
            case    USB_D0DMA:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
                p_reg = (void *)&(USB_M1.D0FIFOSEL);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
                p_reg = (void *)&(USB_M0.D0FIFOSEL);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
                break;
            case    USB_D1USE:
            case    USB_D1DMA:
#if USB_CFG_USE_USBIP == USB_CFG_IP1
                p_reg = (void *)&(USB_M1.D1FIFOSEL);

#else   /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
                p_reg = (void *)&(USB_M0.D1FIFOSEL);

#endif  /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
            break;
            default:
            USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE12);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        switch (pipemode)
        {
            case USB_CUSE :
                p_reg = (void *) &(ptr->ipp->CFIFOSEL);
            break;
            case USB_D0USE :
            case    USB_D0DMA:
                p_reg = (void *) &(ptr->ipp->D0FIFOSEL);
            break;
            case USB_D1USE :
            case    USB_D1DMA:
                p_reg = (void *) &(ptr->ipp->D1FIFOSEL);
            break;
            default :
                USB_DEBUG_HOOK(USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE12);
            break;
        }

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
    return p_reg;
}
/******************************************************************************
 End of function hw_usb_get_fifosel_adr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_fifosel
 Description     : Returns the value of the specified pipemode's FIFOSEL register.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : FIFOSEL content
 ******************************************************************************/
uint16_t hw_usb_read_fifosel (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile uint16_t *p_reg;

    p_reg = (uint16_t *) hw_usb_get_fifosel_adr(ptr, pipemode);

    return *p_reg;
}
/******************************************************************************
 End of function hw_usb_read_fifosel
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_rmw_fifosel
 Description     : Data is written to the specified pipemode's FIFOSEL register 
                 : (the FIFOSEL corresponding to the specified PIPEMODE), using 
                 : read-modify-write.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
                 : uint16_t  data      : Setting value
                 : uint16_t bitptn   : bitptn: Bit pattern to read-modify-write.
 Return value    : none
 ******************************************************************************/
void hw_usb_rmw_fifosel (usb_utr_t *ptr, uint16_t pipemode, uint16_t data, uint16_t bitptn)
{
    uint16_t buf;
    volatile uint16_t *p_reg;

    p_reg = (uint16_t *) hw_usb_get_fifosel_adr(ptr, pipemode);

    buf = *p_reg;
    buf &= (~bitptn);
    buf |= (data & bitptn);
    *p_reg = buf;
}
/******************************************************************************
 End of function hw_usb_rmw_fifosel
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_set_dclrm
 Description     : Set DCLRM-bits (FIFO buffer auto clear) of the FIFOSEL cor-
                 : responding to specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
void hw_usb_set_dclrm (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile uint16_t *p_reg;

    p_reg = (uint16_t *) hw_usb_get_fifosel_adr(ptr, pipemode);

    (*p_reg) |= USB_DCLRM;
}
/******************************************************************************
 End of function hw_usb_set_dclrm
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_dclrm
 Description     : Reset DCLRM-bits (FIFO buffer not auto-cleared) of the FIFOSEL 
                 : corresponding to the specified PIPEMODE.
 Arguments       : usb_utr_t *ptr      : Pointer to usb_utr_t structure.
                 : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_dclrm (usb_utr_t *ptr, uint16_t pipemode)
{
    volatile uint16_t *p_reg;

    p_reg = hw_usb_get_fifosel_adr(ptr, pipemode);

    (*p_reg) &= (~USB_DCLRM);
}
/******************************************************************************
 End of function hw_usb_clear_dclrm
 ******************************************************************************/

