tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/hw/r_usb_creg_access.c
}
/******************************************************************************
 End of function hw_usb_clear_enb_vbse
 ******************************************************************************/

/******************************************************************************
 Description     : Clear the SOFE-bit of INTENB register,
 : to prohibit Frame Number Update interrupts.
 Function Name   : hw_usb_clear_enb_sofe
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_enb_sofe (usb_utr_t *ptr)
{
    ptr->ipp->INTENB0.WORD &= (~USB_SOFE);

}
/******************************************************************************
 End of function hw_usb_clear_enb_sofe
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_brdyenb
 Description     : Data is written to BRDYENB register, 
                 : enabling/disabling each respective pipe's BRDY interrupt. 
                 : (The BRDY interrupt indicates that a FIFO port is accessible.)
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_brdyenb (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->BRDYENB.WORD = data;

}
/******************************************************************************
 End of function hw_usb_write_brdyenb
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 Function Name   : hw_usb_set_brdyenb
 Description     : A bit is set in the specified pipe's BRDYENB, enabling the 
                 : respective pipe BRDY interrupt(s).
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_set_brdyenb (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.BRDYENB.WORD |= (1 << pipeno);
#else
        USB_M1.BRDYENB.WORD |= (1 << pipeno);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->BRDYENB.WORD |= (1 << pipeno);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_brdyenb
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_clear_brdyenb
 Description     : Clear the PIPExBRDYE-bit of the specified pipe to prohibit 
                 : BRDY interrupts of that pipe.
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_brdyenb (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.BRDYENB.WORD &= (~(1 << pipeno));
#else
        USB_M1.BRDYENB.WORD &= (~(1 << pipeno));
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->BRDYENB.WORD &= (~(1 << pipeno));

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_brdyenb
 ******************************************************************************/

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Function Name   : hw_usb_write_nrdyenb
 Description     : Data is written to NRDYENB register, 
                 : enabling/disabling each respective pipe's NRDY interrupt
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  data   : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_nrdyenb (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->NRDYENB.WORD = data;
}
/******************************************************************************
 End of function hw_usb_write_nrdyenb
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 Function Name   : hw_usb_set_nrdyenb
 Description     : A bit is set in the specified pipe's NRDYENB, enabling the 
                 : respective pipe NRDY interrupt(s).
 Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno : Pipe number
 Return value    : none
 ******************************************************************************/
void hw_usb_set_nrdyenb (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.NRDYENB.WORD |= (1 << pipeno);
#else
        USB_M1.NRDYENB.WORD |= (1 << pipeno);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->NRDYENB.WORD |= (1 << pipeno);

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_set_nrdyenb
 ******************************************************************************/

