tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX63N/r_usb_basic/src/hw/r_usb_creg_access.c
/******************************************************************************
 Function Name   : hw_usb_write_intsts
 Description     : Data is written to INTSTS0 register.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_write_intsts (usb_utr_t *ptr, uint16_t data)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.INTSTS0.WORD = data;
#else
        USB_M1.INTSTS0.WORD = data;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->INTSTS0.WORD = data;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_write_intsts
 ******************************************************************************/

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Function Name   : hw_usb_clear_sts_sofr
 Description     : Clear the SOFR-bit (Frame Number Refresh Interrupt Status) of 
                 : the clear SOF interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_sts_sofr (usb_utr_t *ptr)
{
    ptr->ipp->INTSTS0.WORD = (uint16_t) ~USB_SOFR;

}
/******************************************************************************
 End of function hw_usb_clear_sts_sofr
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_read_brdysts
 Description     : Returns BRDYSTS register content.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
 Return value    : BRDYSTS content
 ******************************************************************************/
uint16_t hw_usb_read_brdysts (usb_utr_t *ptr)
{
    return ptr->ipp->BRDYSTS.WORD;

}
/******************************************************************************
 End of function hw_usb_read_brdysts
 ******************************************************************************/

/******************************************************************************
 Function Name   : hw_usb_write_brdysts
 Description     : Data is written to BRDYSTS register, to set the BRDY interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_write_brdysts (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->BRDYSTS.WORD = data;
} /* End of function hw_usb_write_brdysts() */
/******************************************************************************
 End of function hw_usb_write_brdysts
 ******************************************************************************/
#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 Function Name   : hw_usb_clear_sts_brdy
 Description     : Clear the PIPExBRDY status bit of the specified pipe to clear 
                 : its BRDY interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno: Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_sts_brdy (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.BRDYSTS.WORD = (uint16_t) (~(1 << pipeno)) & BRDYSTS_MASK;
#else
        USB_M1.BRDYSTS.WORD = (uint16_t) (~(1 << pipeno)) & BRDYSTS_MASK;
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->BRDYSTS.WORD = (uint16_t) (~(1 << pipeno)) & BRDYSTS_MASK;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_sts_brdy
 ******************************************************************************/

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Function Name   : hw_usb_write_nrdy_sts
 Description     : Data is written to NRDYSTS register, to
                 : set the NRDY interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : The value to write.
 Return value    : none
 ******************************************************************************/
void hw_usb_write_nrdy_sts (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->NRDYSTS.WORD = data;
}
/******************************************************************************
 End of function hw_usb_clear_status_nrdy
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 Function Name   : hw_usb_clear_status_nrdy
 Description     : Clear the PIPExNRDY status bit of the specified pipe to clear 
                 : its NRDY interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  pipeno: Pipe number.
 Return value    : none
 ******************************************************************************/
void hw_usb_clear_status_nrdy (usb_utr_t *ptr, uint16_t pipeno)
{
    if (USB_NULL == ptr)
    {
#if ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI )
#if USB_CFG_USE_USBIP == USB_CFG_IP0
        USB_M0.NRDYSTS.WORD = (uint16_t) ((~(1 << pipeno)) & NRDYSTS_MASK);
#else
        USB_M1.NRDYSTS.WORD = (uint16_t) ((~(1 << pipeno)) & NRDYSTS_MASK);
#endif
#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
        ptr->ipp->NRDYSTS.WORD = (uint16_t) (~(1 << pipeno)) & NRDYSTS_MASK;

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */
    }
}
/******************************************************************************
 End of function hw_usb_clear_status_nrdy
 ******************************************************************************/

#if ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST )
/******************************************************************************
 Function Name   : hw_usb_write_bempsts
 Description     : Data is written to BEMPSTS register, to set the BEMP interrupt status.
 Arguments       : usb_utr_t *ptr  : Pointer to usb_utr_t structure.
                 : uint16_t  data  : Setting value
 Return value    : none
 ******************************************************************************/
void hw_usb_write_bempsts (usb_utr_t *ptr, uint16_t data)
{
    ptr->ipp->BEMPSTS.WORD = data;
}
/******************************************************************************
 End of function hw_usb_write_bempsts
 ******************************************************************************/

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

